const data = [
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 32
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 40
                },
                {
                    "label": "عدد الكلمات",
                    "value": 30080
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "A",
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H"
                ],
                "numLines": [
                    1,
                    2,
                    3,
                    4,
                    5
                ],
                "excelTable": [
                    [
                        103,
                        47,
                        25,
                        85,
                        94,
                        38,
                        85
                    ],
                    [
                        139,
                        30,
                        14,
                        147,
                        66,
                        118,
                        112
                    ],
                    [
                        70,
                        112,
                        48,
                        35,
                        82,
                        140,
                        26
                    ],
                    [
                        81,
                        82,
                        148,
                        93,
                        101,
                        87,
                        11
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(B2:H2)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(B4:H4)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(B3:H3)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(B2:H5)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(C5:G5)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(E2:E5)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(B2:B5)",
                    "result": 393
                },
                {
                    "func": "=Si(G5 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(B2:B5)",
                    "result": 139
                },
                {
                    "func": "=SOMME(H2:H5)",
                    "result": 234
                },
                {
                    "func": "=MIN(C3:G3)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(D3:E4)",
                    "result": 61
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "التأملات (ماركوس)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 43
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 76
                },
                {
                    "label": "عدد الكلمات",
                    "value": 48716
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I"
                ],
                "numLines": [
                    2,
                    3,
                    4,
                    5,
                    6
                ],
                "excelTable": [
                    [
                        99,
                        111,
                        40,
                        63,
                        149,
                        57,
                        121
                    ],
                    [
                        85,
                        92,
                        146,
                        36,
                        79,
                        43,
                        47
                    ],
                    [
                        75,
                        33,
                        84,
                        141,
                        114,
                        130,
                        70
                    ],
                    [
                        66,
                        95,
                        104,
                        40,
                        95,
                        146,
                        127
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(C3:I3)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(C5:I5)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(C4:I4)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(C3:I6)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(D6:H6)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(F3:F6)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(C3:C6)",
                    "result": 325
                },
                {
                    "func": "=Si(C4 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(C3:C6)",
                    "result": 99
                },
                {
                    "func": "=SOMME(I3:I6)",
                    "result": 365
                },
                {
                    "func": "=MIN(D4:H4)",
                    "result": 36
                },
                {
                    "func": "=MOYENNE(E4:F5)",
                    "result": 101.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "ثورة فرنسا (كارلايل)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 117
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 130
                },
                {
                    "label": "عدد الكلمات",
                    "value": 91650
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J"
                ],
                "numLines": [
                    3,
                    4,
                    5,
                    6,
                    7
                ],
                "excelTable": [
                    [
                        96,
                        43,
                        107,
                        97,
                        23,
                        116,
                        118
                    ],
                    [
                        128,
                        15,
                        21,
                        100,
                        39,
                        56,
                        101
                    ],
                    [
                        138,
                        72,
                        56,
                        119,
                        144,
                        134,
                        25
                    ],
                    [
                        91,
                        145,
                        17,
                        104,
                        134,
                        109,
                        140
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(D4:J4)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(D6:J6)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(D5:J5)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(D4:J7)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(E7:I7)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(G4:G7)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(D4:D7)",
                    "result": 453
                },
                {
                    "func": "=Si(I4 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(D4:D7)",
                    "result": 138
                },
                {
                    "func": "=SOMME(J4:J7)",
                    "result": 384
                },
                {
                    "func": "=MIN(E5:I5)",
                    "result": 15
                },
                {
                    "func": "=MOYENNE(F5:G6)",
                    "result": 74
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "العقل الباطن (فرويد)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 32
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 128
                },
                {
                    "label": "عدد الكلمات",
                    "value": 67584
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K"
                ],
                "numLines": [
                    4,
                    5,
                    6,
                    7,
                    8
                ],
                "excelTable": [
                    [
                        46,
                        29,
                        108,
                        102,
                        139,
                        121,
                        119
                    ],
                    [
                        14,
                        87,
                        15,
                        94,
                        120,
                        95,
                        58
                    ],
                    [
                        128,
                        132,
                        140,
                        78,
                        66,
                        45,
                        68
                    ],
                    [
                        21,
                        147,
                        40,
                        21,
                        147,
                        94,
                        113
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(E5:K5)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(E7:K7)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(E6:K6)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(E5:K8)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(F8:J8)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(H5:H8)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(E5:E8)",
                    "result": 209
                },
                {
                    "func": "=Si(H6 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(E5:E8)",
                    "result": 128
                },
                {
                    "func": "=SOMME(K5:K8)",
                    "result": 358
                },
                {
                    "func": "=MIN(F6:J6)",
                    "result": 15
                },
                {
                    "func": "=MOYENNE(G6:H7)",
                    "result": 81.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مقدمة (ابن خلدون)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 19
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 78
                },
                {
                    "label": "عدد الكلمات",
                    "value": 59358
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L"
                ],
                "numLines": [
                    5,
                    6,
                    7,
                    8,
                    9
                ],
                "excelTable": [
                    [
                        77,
                        23,
                        138,
                        11,
                        105,
                        110,
                        42
                    ],
                    [
                        25,
                        70,
                        26,
                        148,
                        58,
                        133,
                        36
                    ],
                    [
                        67,
                        59,
                        17,
                        98,
                        65,
                        121,
                        113
                    ],
                    [
                        135,
                        136,
                        135,
                        39,
                        81,
                        56,
                        148
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(F6:L6)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(F8:L8)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(F7:L7)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(F6:L9)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(G9:K9)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(I6:I9)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(F6:F9)",
                    "result": 304
                },
                {
                    "func": "=Si(L7 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(F6:F9)",
                    "result": 135
                },
                {
                    "func": "=SOMME(L6:L9)",
                    "result": 339
                },
                {
                    "func": "=MIN(G7:K7)",
                    "result": 26
                },
                {
                    "func": "=MOYENNE(H7:I8)",
                    "result": 72.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "هاملت (شكسبير)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 71
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 109
                },
                {
                    "label": "عدد الكلمات",
                    "value": 76845
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M"
                ],
                "numLines": [
                    6,
                    7,
                    8,
                    9,
                    10
                ],
                "excelTable": [
                    [
                        146,
                        37,
                        75,
                        142,
                        142,
                        62,
                        36
                    ],
                    [
                        52,
                        145,
                        82,
                        65,
                        103,
                        39,
                        75
                    ],
                    [
                        47,
                        131,
                        68,
                        56,
                        124,
                        11,
                        112
                    ],
                    [
                        70,
                        121,
                        71,
                        59,
                        35,
                        61,
                        39
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(G7:M7)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(G9:M9)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(G8:M8)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(G7:M10)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(H10:L10)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(J7:J10)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(G7:G10)",
                    "result": 315
                },
                {
                    "func": "=Si(J9 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(G7:G10)",
                    "result": 146
                },
                {
                    "func": "=SOMME(M7:M10)",
                    "result": 262
                },
                {
                    "func": "=MIN(H8:L8)",
                    "result": 39
                },
                {
                    "func": "=MOYENNE(I8:J9)",
                    "result": 67.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "أصل الأنواع (داروين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 6
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 62
                },
                {
                    "label": "عدد الكلمات",
                    "value": 38068
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N"
                ],
                "numLines": [
                    7,
                    8,
                    9,
                    10,
                    11
                ],
                "excelTable": [
                    [
                        140,
                        26,
                        54,
                        66,
                        29,
                        24,
                        67
                    ],
                    [
                        61,
                        72,
                        32,
                        54,
                        99,
                        36,
                        77
                    ],
                    [
                        66,
                        98,
                        52,
                        79,
                        109,
                        85,
                        107
                    ],
                    [
                        65,
                        106,
                        49,
                        139,
                        115,
                        105,
                        99
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(H8:N8)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(H10:N10)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(H9:N9)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(H8:N11)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(I11:M11)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(K8:K11)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(H8:H11)",
                    "result": 332
                },
                {
                    "func": "=Si(J9 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(H8:H11)",
                    "result": 140
                },
                {
                    "func": "=SOMME(N8:N11)",
                    "result": 350
                },
                {
                    "func": "=MIN(I9:M9)",
                    "result": 32
                },
                {
                    "func": "=MOYENNE(J9:K10)",
                    "result": 54.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "عالم صوفي (غاردر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 68
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 90
                },
                {
                    "label": "عدد الكلمات",
                    "value": 65700
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O"
                ],
                "numLines": [
                    8,
                    9,
                    10,
                    11,
                    12
                ],
                "excelTable": [
                    [
                        16,
                        47,
                        110,
                        129,
                        51,
                        139,
                        111
                    ],
                    [
                        111,
                        14,
                        119,
                        113,
                        109,
                        116,
                        19
                    ],
                    [
                        65,
                        75,
                        148,
                        73,
                        71,
                        33,
                        55
                    ],
                    [
                        117,
                        115,
                        139,
                        28,
                        128,
                        72,
                        123
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(I9:O9)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(I11:O11)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(I10:O10)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(I9:O12)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(J12:N12)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(L9:L12)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(I9:I12)",
                    "result": 309
                },
                {
                    "func": "=Si(K10 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(I9:I12)",
                    "result": 117
                },
                {
                    "func": "=SOMME(O9:O12)",
                    "result": 308
                },
                {
                    "func": "=MIN(J10:N10)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(K10:L11)",
                    "result": 113.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "السياسة (أرسطو)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 47
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 83
                },
                {
                    "label": "عدد الكلمات",
                    "value": 65736
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P"
                ],
                "numLines": [
                    9,
                    10,
                    11,
                    12,
                    13
                ],
                "excelTable": [
                    [
                        39,
                        89,
                        52,
                        29,
                        125,
                        54,
                        15
                    ],
                    [
                        13,
                        34,
                        59,
                        127,
                        59,
                        56,
                        138
                    ],
                    [
                        89,
                        86,
                        88,
                        57,
                        66,
                        102,
                        12
                    ],
                    [
                        67,
                        72,
                        114,
                        85,
                        78,
                        47,
                        31
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(J10:P10)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(J12:P12)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(J11:P11)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(J10:P13)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(K13:O13)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(M10:M13)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(J10:J13)",
                    "result": 208
                },
                {
                    "func": "=Si(M11 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(J10:J13)",
                    "result": 89
                },
                {
                    "func": "=SOMME(P10:P13)",
                    "result": 196
                },
                {
                    "func": "=MIN(K11:O11)",
                    "result": 34
                },
                {
                    "func": "=MOYENNE(L11:M12)",
                    "result": 82.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مقدمة (ابن خلدون)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 75
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 127
                },
                {
                    "label": "عدد الكلمات",
                    "value": 70993
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q"
                ],
                "numLines": [
                    10,
                    11,
                    12,
                    13,
                    14
                ],
                "excelTable": [
                    [
                        142,
                        26,
                        90,
                        44,
                        137,
                        145,
                        108
                    ],
                    [
                        43,
                        52,
                        108,
                        74,
                        49,
                        10,
                        20
                    ],
                    [
                        22,
                        87,
                        128,
                        13,
                        116,
                        49,
                        114
                    ],
                    [
                        126,
                        132,
                        65,
                        41,
                        21,
                        97,
                        30
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(K11:Q11)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(K13:Q13)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(K12:Q12)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(K11:Q14)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(L14:P14)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(N11:N14)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(K11:K14)",
                    "result": 333
                },
                {
                    "func": "=Si(O13 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(K11:K14)",
                    "result": 142
                },
                {
                    "func": "=SOMME(Q11:Q14)",
                    "result": 272
                },
                {
                    "func": "=MIN(L12:P12)",
                    "result": 10
                },
                {
                    "func": "=MOYENNE(M12:N13)",
                    "result": 80.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 46
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 89
                },
                {
                    "label": "عدد الكلمات",
                    "value": 70755
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R"
                ],
                "numLines": [
                    11,
                    12,
                    13,
                    14,
                    15
                ],
                "excelTable": [
                    [
                        64,
                        41,
                        113,
                        65,
                        37,
                        133,
                        147
                    ],
                    [
                        96,
                        93,
                        147,
                        142,
                        144,
                        91,
                        56
                    ],
                    [
                        57,
                        116,
                        39,
                        44,
                        127,
                        84,
                        40
                    ],
                    [
                        66,
                        112,
                        115,
                        45,
                        63,
                        127,
                        32
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(L12:R12)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(L14:R14)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(L13:R13)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(L12:R15)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(M15:Q15)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(O12:O15)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(L12:L15)",
                    "result": 283
                },
                {
                    "func": "=Si(P15 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(L12:L15)",
                    "result": 96
                },
                {
                    "func": "=SOMME(R12:R15)",
                    "result": 275
                },
                {
                    "func": "=MIN(M13:Q13)",
                    "result": 91
                },
                {
                    "func": "=MOYENNE(N13:O14)",
                    "result": 93
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "أصل الأنواع (داروين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 37
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 48
                },
                {
                    "label": "عدد الكلمات",
                    "value": 33312
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S"
                ],
                "numLines": [
                    12,
                    13,
                    14,
                    15,
                    16
                ],
                "excelTable": [
                    [
                        75,
                        41,
                        104,
                        146,
                        86,
                        77,
                        27
                    ],
                    [
                        127,
                        114,
                        47,
                        139,
                        111,
                        149,
                        127
                    ],
                    [
                        117,
                        32,
                        128,
                        40,
                        117,
                        71,
                        81
                    ],
                    [
                        107,
                        121,
                        25,
                        89,
                        140,
                        99,
                        56
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(M13:S13)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(M15:S15)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(M14:S14)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(M13:S16)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(N16:R16)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(P13:P16)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(M13:M16)",
                    "result": 426
                },
                {
                    "func": "=Si(O14 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(M13:M16)",
                    "result": 127
                },
                {
                    "func": "=SOMME(S13:S16)",
                    "result": 291
                },
                {
                    "func": "=MIN(N14:R14)",
                    "result": 47
                },
                {
                    "func": "=MOYENNE(O14:P15)",
                    "result": 88.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الوجود والعدم (سارتر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 27
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 117
                },
                {
                    "label": "عدد الكلمات",
                    "value": 72189
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T"
                ],
                "numLines": [
                    13,
                    14,
                    15,
                    16,
                    17
                ],
                "excelTable": [
                    [
                        46,
                        80,
                        71,
                        147,
                        85,
                        118,
                        148
                    ],
                    [
                        115,
                        103,
                        78,
                        134,
                        107,
                        52,
                        38
                    ],
                    [
                        136,
                        46,
                        111,
                        102,
                        95,
                        105,
                        12
                    ],
                    [
                        46,
                        22,
                        76,
                        105,
                        92,
                        20,
                        146
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(N14:T14)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(N16:T16)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(N15:T15)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(N14:T17)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(O17:S17)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(Q14:Q17)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(N14:N17)",
                    "result": 343
                },
                {
                    "func": "=Si(S15 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(N14:N17)",
                    "result": 136
                },
                {
                    "func": "=SOMME(T14:T17)",
                    "result": 344
                },
                {
                    "func": "=MIN(O15:S15)",
                    "result": 52
                },
                {
                    "func": "=MOYENNE(P15:Q16)",
                    "result": 106.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "إحياء الدين (الغزالي)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 36
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 88
                },
                {
                    "label": "عدد الكلمات",
                    "value": 58080
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U"
                ],
                "numLines": [
                    14,
                    15,
                    16,
                    17,
                    18
                ],
                "excelTable": [
                    [
                        11,
                        128,
                        18,
                        105,
                        104,
                        71,
                        76
                    ],
                    [
                        136,
                        88,
                        106,
                        55,
                        46,
                        107,
                        68
                    ],
                    [
                        126,
                        117,
                        65,
                        83,
                        110,
                        146,
                        76
                    ],
                    [
                        70,
                        145,
                        51,
                        71,
                        98,
                        52,
                        136
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(O15:U15)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(O17:U17)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(O16:U16)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(O15:U18)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(P18:T18)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(R15:R18)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(O15:O18)",
                    "result": 343
                },
                {
                    "func": "=Si(R18 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(O15:O18)",
                    "result": 136
                },
                {
                    "func": "=SOMME(U15:U18)",
                    "result": 356
                },
                {
                    "func": "=MIN(P16:T16)",
                    "result": 46
                },
                {
                    "func": "=MOYENNE(Q16:R17)",
                    "result": 77.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مبادئ (نيوتن)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 36
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 37
                },
                {
                    "label": "عدد الكلمات",
                    "value": 28046
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V"
                ],
                "numLines": [
                    15,
                    16,
                    17,
                    18,
                    19
                ],
                "excelTable": [
                    [
                        14,
                        14,
                        118,
                        88,
                        79,
                        67,
                        136
                    ],
                    [
                        19,
                        132,
                        144,
                        52,
                        104,
                        69,
                        27
                    ],
                    [
                        47,
                        92,
                        71,
                        61,
                        14,
                        79,
                        86
                    ],
                    [
                        140,
                        70,
                        16,
                        146,
                        32,
                        17,
                        56
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(P16:V16)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(P18:V18)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(P17:V17)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(P16:V19)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(Q19:U19)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(S16:S19)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(P16:P19)",
                    "result": 220
                },
                {
                    "func": "=Si(P19 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(P16:P19)",
                    "result": 140
                },
                {
                    "func": "=SOMME(V16:V19)",
                    "result": 305
                },
                {
                    "func": "=MIN(Q17:U17)",
                    "result": 52
                },
                {
                    "func": "=MOYENNE(R17:S18)",
                    "result": 82
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الشعر (أرسطو)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 31
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 72
                },
                {
                    "label": "عدد الكلمات",
                    "value": 38376
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W"
                ],
                "numLines": [
                    16,
                    17,
                    18,
                    19,
                    20
                ],
                "excelTable": [
                    [
                        38,
                        22,
                        44,
                        130,
                        71,
                        118,
                        35
                    ],
                    [
                        107,
                        42,
                        13,
                        73,
                        83,
                        44,
                        60
                    ],
                    [
                        106,
                        136,
                        94,
                        78,
                        105,
                        128,
                        101
                    ],
                    [
                        31,
                        111,
                        20,
                        84,
                        65,
                        148,
                        46
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(Q17:W17)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(Q19:W19)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(Q18:W18)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(Q17:W20)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(R20:V20)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(T17:T20)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(Q17:Q20)",
                    "result": 282
                },
                {
                    "func": "=Si(V20 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(Q17:Q20)",
                    "result": 107
                },
                {
                    "func": "=SOMME(W17:W20)",
                    "result": 242
                },
                {
                    "func": "=MIN(R18:V18)",
                    "result": 13
                },
                {
                    "func": "=MOYENNE(S18:T19)",
                    "result": 64.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 55
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 85
                },
                {
                    "label": "عدد الكلمات",
                    "value": 49725
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X"
                ],
                "numLines": [
                    17,
                    18,
                    19,
                    20,
                    21
                ],
                "excelTable": [
                    [
                        86,
                        76,
                        31,
                        112,
                        69,
                        50,
                        39
                    ],
                    [
                        107,
                        32,
                        54,
                        33,
                        124,
                        49,
                        140
                    ],
                    [
                        58,
                        96,
                        70,
                        62,
                        25,
                        39,
                        138
                    ],
                    [
                        129,
                        52,
                        64,
                        144,
                        12,
                        11,
                        123
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(R18:X18)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(R20:X20)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(R19:X19)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(R18:X21)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(S21:W21)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(U18:U21)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(R18:R21)",
                    "result": 380
                },
                {
                    "func": "=Si(U21 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(R18:R21)",
                    "result": 129
                },
                {
                    "func": "=SOMME(X18:X21)",
                    "result": 440
                },
                {
                    "func": "=MIN(S19:W19)",
                    "result": 32
                },
                {
                    "func": "=MOYENNE(T19:U20)",
                    "result": 54.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 14
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 148
                },
                {
                    "label": "عدد الكلمات",
                    "value": 82288
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X",
                    "Y"
                ],
                "numLines": [
                    18,
                    19,
                    20,
                    21,
                    22
                ],
                "excelTable": [
                    [
                        122,
                        34,
                        131,
                        72,
                        45,
                        140,
                        125
                    ],
                    [
                        98,
                        93,
                        136,
                        121,
                        40,
                        49,
                        59
                    ],
                    [
                        112,
                        120,
                        83,
                        71,
                        119,
                        96,
                        107
                    ],
                    [
                        44,
                        90,
                        51,
                        25,
                        10,
                        124,
                        77
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(S19:Y19)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(S21:Y21)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(S20:Y20)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(S19:Y22)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(T22:X22)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(V19:V22)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(S19:S22)",
                    "result": 376
                },
                {
                    "func": "=Si(S21 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(S19:S22)",
                    "result": 122
                },
                {
                    "func": "=SOMME(Y19:Y22)",
                    "result": 368
                },
                {
                    "func": "=MIN(T20:X20)",
                    "result": 40
                },
                {
                    "func": "=MOYENNE(U20:V21)",
                    "result": 102.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 64
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 71
                },
                {
                    "label": "عدد الكلمات",
                    "value": 53179
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X",
                    "Y",
                    "Z"
                ],
                "numLines": [
                    19,
                    20,
                    21,
                    22,
                    23
                ],
                "excelTable": [
                    [
                        56,
                        21,
                        106,
                        43,
                        145,
                        48,
                        112
                    ],
                    [
                        46,
                        76,
                        124,
                        81,
                        127,
                        121,
                        30
                    ],
                    [
                        80,
                        99,
                        100,
                        48,
                        118,
                        142,
                        62
                    ],
                    [
                        26,
                        137,
                        42,
                        56,
                        95,
                        41,
                        32
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(T20:Z20)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(T22:Z22)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(T21:Z21)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(T20:Z23)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(U23:Y23)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(W20:W23)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(T20:T23)",
                    "result": 208
                },
                {
                    "func": "=Si(V22 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(T20:T23)",
                    "result": 80
                },
                {
                    "func": "=SOMME(Z20:Z23)",
                    "result": 236
                },
                {
                    "func": "=MIN(U21:Y21)",
                    "result": 76
                },
                {
                    "func": "=MOYENNE(V21:W22)",
                    "result": 88.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "العقل الباطن (فرويد)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 4
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 65
                },
                {
                    "label": "عدد الكلمات",
                    "value": 48100
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "A",
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H"
                ],
                "numLines": [
                    20,
                    21,
                    22,
                    23,
                    24
                ],
                "excelTable": [
                    [
                        61,
                        103,
                        84,
                        70,
                        44,
                        136,
                        99
                    ],
                    [
                        99,
                        74,
                        53,
                        138,
                        14,
                        96,
                        61
                    ],
                    [
                        56,
                        143,
                        126,
                        53,
                        95,
                        139,
                        39
                    ],
                    [
                        117,
                        35,
                        48,
                        149,
                        76,
                        69,
                        55
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(B21:H21)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(B23:H23)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(B22:H22)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(B21:H24)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(C24:G24)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(E21:E24)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(B21:B24)",
                    "result": 333
                },
                {
                    "func": "=Si(F21 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(B21:B24)",
                    "result": 117
                },
                {
                    "func": "=SOMME(H21:H24)",
                    "result": 254
                },
                {
                    "func": "=MIN(C22:G22)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(D22:E23)",
                    "result": 92.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الجمهورية (أفلاطون)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 42
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 90
                },
                {
                    "label": "عدد الكلمات",
                    "value": 70470
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I"
                ],
                "numLines": [
                    21,
                    22,
                    23,
                    24,
                    25
                ],
                "excelTable": [
                    [
                        64,
                        67,
                        11,
                        121,
                        45,
                        149,
                        136
                    ],
                    [
                        136,
                        30,
                        43,
                        29,
                        84,
                        74,
                        40
                    ],
                    [
                        16,
                        139,
                        14,
                        53,
                        113,
                        31,
                        123
                    ],
                    [
                        55,
                        76,
                        47,
                        105,
                        95,
                        126,
                        114
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(C22:I22)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(C24:I24)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(C23:I23)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(C22:I25)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(D25:H25)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(F22:F25)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(C22:C25)",
                    "result": 271
                },
                {
                    "func": "=Si(E22 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(C22:C25)",
                    "result": 136
                },
                {
                    "func": "=SOMME(I22:I25)",
                    "result": 413
                },
                {
                    "func": "=MIN(D23:H23)",
                    "result": 29
                },
                {
                    "func": "=MOYENNE(E23:F24)",
                    "result": 34.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "التركيب الذري (بوهر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 18
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 59
                },
                {
                    "label": "عدد الكلمات",
                    "value": 44427
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J"
                ],
                "numLines": [
                    22,
                    23,
                    24,
                    25,
                    26
                ],
                "excelTable": [
                    [
                        17,
                        76,
                        148,
                        98,
                        10,
                        13,
                        22
                    ],
                    [
                        129,
                        61,
                        105,
                        115,
                        38,
                        131,
                        72
                    ],
                    [
                        144,
                        60,
                        143,
                        147,
                        131,
                        12,
                        136
                    ],
                    [
                        141,
                        121,
                        109,
                        86,
                        89,
                        81,
                        91
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(D23:J23)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(D25:J25)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(D24:J24)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(D23:J26)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(E26:I26)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(G23:G26)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(D23:D26)",
                    "result": 431
                },
                {
                    "func": "=Si(E24 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(D23:D26)",
                    "result": 144
                },
                {
                    "func": "=SOMME(J23:J26)",
                    "result": 321
                },
                {
                    "func": "=MIN(E24:I24)",
                    "result": 38
                },
                {
                    "func": "=MOYENNE(F24:G25)",
                    "result": 127.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مواقف (ابن رشد)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 76
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 77
                },
                {
                    "label": "عدد الكلمات",
                    "value": 59444
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K"
                ],
                "numLines": [
                    23,
                    24,
                    25,
                    26,
                    27
                ],
                "excelTable": [
                    [
                        54,
                        15,
                        136,
                        70,
                        52,
                        143,
                        79
                    ],
                    [
                        63,
                        72,
                        62,
                        100,
                        71,
                        124,
                        142
                    ],
                    [
                        70,
                        107,
                        140,
                        132,
                        107,
                        22,
                        60
                    ],
                    [
                        113,
                        35,
                        94,
                        63,
                        63,
                        85,
                        10
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(E24:K24)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(E26:K26)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(E25:K25)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(E24:K27)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(F27:J27)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(H24:H27)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(E24:E27)",
                    "result": 300
                },
                {
                    "func": "=Si(I25 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(E24:E27)",
                    "result": 113
                },
                {
                    "func": "=SOMME(K24:K27)",
                    "result": 291
                },
                {
                    "func": "=MIN(F25:J25)",
                    "result": 62
                },
                {
                    "func": "=MOYENNE(G25:H26)",
                    "result": 108.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الذات والكون (هيكل)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 38
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 96
                },
                {
                    "label": "عدد الكلمات",
                    "value": 62208
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "E",
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L"
                ],
                "numLines": [
                    24,
                    25,
                    26,
                    27,
                    28
                ],
                "excelTable": [
                    [
                        14,
                        93,
                        32,
                        13,
                        100,
                        65,
                        54
                    ],
                    [
                        131,
                        68,
                        96,
                        57,
                        14,
                        56,
                        52
                    ],
                    [
                        145,
                        54,
                        64,
                        100,
                        54,
                        51,
                        103
                    ],
                    [
                        148,
                        53,
                        24,
                        100,
                        78,
                        75,
                        18
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(F25:L25)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(F27:L27)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(F26:L26)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(F25:L28)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(G28:K28)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(I25:I28)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(F25:F28)",
                    "result": 438
                },
                {
                    "func": "=Si(F28 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(F25:F28)",
                    "result": 148
                },
                {
                    "func": "=SOMME(L25:L28)",
                    "result": 227
                },
                {
                    "func": "=MIN(G26:K26)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(H26:I27)",
                    "result": 79.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "التركيب الذري (بوهر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 23
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 39
                },
                {
                    "label": "عدد الكلمات",
                    "value": 23673
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "F",
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M"
                ],
                "numLines": [
                    25,
                    26,
                    27,
                    28,
                    29
                ],
                "excelTable": [
                    [
                        123,
                        119,
                        14,
                        48,
                        19,
                        125,
                        33
                    ],
                    [
                        36,
                        128,
                        32,
                        144,
                        14,
                        95,
                        86
                    ],
                    [
                        127,
                        96,
                        128,
                        56,
                        77,
                        61,
                        144
                    ],
                    [
                        11,
                        67,
                        39,
                        82,
                        86,
                        50,
                        103
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(G26:M26)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(G28:M28)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(G27:M27)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(G26:M29)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(H29:L29)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(J26:J29)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(G26:G29)",
                    "result": 297
                },
                {
                    "func": "=Si(M27 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(G26:G29)",
                    "result": 127
                },
                {
                    "func": "=SOMME(M26:M29)",
                    "result": 366
                },
                {
                    "func": "=MIN(H27:L27)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(I27:J28)",
                    "result": 90
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الطب (ابن سينا)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 61
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 62
                },
                {
                    "label": "عدد الكلمات",
                    "value": 43462
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "G",
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N"
                ],
                "numLines": [
                    26,
                    27,
                    28,
                    29,
                    30
                ],
                "excelTable": [
                    [
                        118,
                        58,
                        119,
                        51,
                        85,
                        129,
                        113
                    ],
                    [
                        92,
                        105,
                        31,
                        134,
                        14,
                        29,
                        70
                    ],
                    [
                        149,
                        134,
                        30,
                        26,
                        93,
                        77,
                        21
                    ],
                    [
                        129,
                        102,
                        149,
                        135,
                        95,
                        119,
                        45
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(H27:N27)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(H29:N29)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(H28:N28)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(H27:N30)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(I30:M30)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(K27:K30)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(H27:H30)",
                    "result": 488
                },
                {
                    "func": "=Si(M28 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(H27:H30)",
                    "result": 149
                },
                {
                    "func": "=SOMME(N27:N30)",
                    "result": 249
                },
                {
                    "func": "=MIN(I28:M28)",
                    "result": 14
                },
                {
                    "func": "=MOYENNE(J28:K29)",
                    "result": 55.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "قوة العادة (دويج)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 43
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 126
                },
                {
                    "label": "عدد الكلمات",
                    "value": 82026
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "H",
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O"
                ],
                "numLines": [
                    27,
                    28,
                    29,
                    30,
                    31
                ],
                "excelTable": [
                    [
                        16,
                        57,
                        129,
                        23,
                        110,
                        12,
                        28
                    ],
                    [
                        106,
                        146,
                        108,
                        95,
                        149,
                        98,
                        120
                    ],
                    [
                        105,
                        115,
                        122,
                        45,
                        118,
                        53,
                        45
                    ],
                    [
                        60,
                        141,
                        116,
                        10,
                        24,
                        28,
                        60
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(I28:O28)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(I30:O30)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(I29:O29)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(I28:O31)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(J31:N31)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(L28:L31)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(I28:I31)",
                    "result": 287
                },
                {
                    "func": "=Si(L30 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(I28:I31)",
                    "result": 106
                },
                {
                    "func": "=SOMME(O28:O31)",
                    "result": 253
                },
                {
                    "func": "=MIN(J29:N29)",
                    "result": 95
                },
                {
                    "func": "=MOYENNE(K29:L30)",
                    "result": 92.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الوجود والعدم (سارتر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 17
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 89
                },
                {
                    "label": "عدد الكلمات",
                    "value": 61499
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "I",
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P"
                ],
                "numLines": [
                    28,
                    29,
                    30,
                    31,
                    32
                ],
                "excelTable": [
                    [
                        73,
                        60,
                        133,
                        48,
                        145,
                        97,
                        144
                    ],
                    [
                        63,
                        136,
                        87,
                        149,
                        38,
                        63,
                        56
                    ],
                    [
                        137,
                        78,
                        19,
                        39,
                        53,
                        107,
                        87
                    ],
                    [
                        144,
                        111,
                        46,
                        31,
                        147,
                        16,
                        11
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(J29:P29)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(J31:P31)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(J30:P30)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(J29:P32)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(K32:O32)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(M29:M32)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(J29:J32)",
                    "result": 417
                },
                {
                    "func": "=Si(J31 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(J29:J32)",
                    "result": 144
                },
                {
                    "func": "=SOMME(P29:P32)",
                    "result": 298
                },
                {
                    "func": "=MIN(K30:O30)",
                    "result": 38
                },
                {
                    "func": "=MOYENNE(L30:M31)",
                    "result": 73.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نهاية التاريخ (فوكوياما)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 33
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 48
                },
                {
                    "label": "عدد الكلمات",
                    "value": 27360
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "J",
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q"
                ],
                "numLines": [
                    29,
                    30,
                    31,
                    32,
                    33
                ],
                "excelTable": [
                    [
                        76,
                        32,
                        73,
                        112,
                        59,
                        39,
                        110
                    ],
                    [
                        59,
                        67,
                        79,
                        135,
                        32,
                        130,
                        122
                    ],
                    [
                        46,
                        77,
                        24,
                        113,
                        95,
                        102,
                        81
                    ],
                    [
                        24,
                        111,
                        18,
                        52,
                        15,
                        100,
                        112
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(K30:Q30)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(K32:Q32)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(K31:Q31)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(K30:Q33)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(L33:P33)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(N30:N33)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(K30:K33)",
                    "result": 205
                },
                {
                    "func": "=Si(M30 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(K30:K33)",
                    "result": 76
                },
                {
                    "func": "=SOMME(Q30:Q33)",
                    "result": 425
                },
                {
                    "func": "=MIN(L31:P31)",
                    "result": 32
                },
                {
                    "func": "=MOYENNE(M31:N32)",
                    "result": 87.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "التركيب الذري (بوهر)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 70
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 78
                },
                {
                    "label": "عدد الكلمات",
                    "value": 50622
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "K",
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R"
                ],
                "numLines": [
                    30,
                    31,
                    32,
                    33,
                    34
                ],
                "excelTable": [
                    [
                        56,
                        14,
                        35,
                        19,
                        100,
                        47,
                        45
                    ],
                    [
                        135,
                        109,
                        10,
                        147,
                        53,
                        98,
                        144
                    ],
                    [
                        127,
                        29,
                        78,
                        94,
                        89,
                        74,
                        120
                    ],
                    [
                        72,
                        52,
                        84,
                        23,
                        100,
                        29,
                        58
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(L31:R31)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(L33:R33)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(L32:R32)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(L31:R34)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(M34:Q34)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(O31:O34)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(L31:L34)",
                    "result": 390
                },
                {
                    "func": "=Si(P34 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(L31:L34)",
                    "result": 135
                },
                {
                    "func": "=SOMME(R31:R34)",
                    "result": 367
                },
                {
                    "func": "=MIN(M32:Q32)",
                    "result": 10
                },
                {
                    "func": "=MOYENNE(N32:O33)",
                    "result": 82.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "العقل الباطن (فرويد)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 17
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 110
                },
                {
                    "label": "عدد الكلمات",
                    "value": 73590
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "L",
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S"
                ],
                "numLines": [
                    31,
                    32,
                    33,
                    34,
                    35
                ],
                "excelTable": [
                    [
                        71,
                        125,
                        68,
                        122,
                        129,
                        143,
                        65
                    ],
                    [
                        22,
                        121,
                        60,
                        119,
                        141,
                        88,
                        125
                    ],
                    [
                        67,
                        12,
                        96,
                        72,
                        91,
                        133,
                        22
                    ],
                    [
                        30,
                        73,
                        127,
                        71,
                        17,
                        33,
                        110
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(M32:S32)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(M34:S34)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(M33:S33)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(M32:S35)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(N35:R35)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(P32:P35)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(M32:M35)",
                    "result": 190
                },
                {
                    "func": "=Si(O34 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(M32:M35)",
                    "result": 71
                },
                {
                    "func": "=SOMME(S32:S35)",
                    "result": 322
                },
                {
                    "func": "=MIN(N33:R33)",
                    "result": 60
                },
                {
                    "func": "=MOYENNE(O33:P34)",
                    "result": 86.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الأموال (آدم سميث)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 86
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 145
                },
                {
                    "label": "عدد الكلمات",
                    "value": 114115
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "M",
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T"
                ],
                "numLines": [
                    32,
                    33,
                    34,
                    35,
                    36
                ],
                "excelTable": [
                    [
                        139,
                        23,
                        70,
                        112,
                        104,
                        32,
                        140
                    ],
                    [
                        10,
                        144,
                        75,
                        100,
                        149,
                        121,
                        22
                    ],
                    [
                        95,
                        141,
                        15,
                        67,
                        25,
                        129,
                        128
                    ],
                    [
                        113,
                        23,
                        123,
                        37,
                        66,
                        57,
                        11
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(N33:T33)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(N35:T35)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(N34:T34)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(N33:T36)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(O36:S36)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(Q33:Q36)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(N33:N36)",
                    "result": 357
                },
                {
                    "func": "=Si(Q36 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(N33:N36)",
                    "result": 139
                },
                {
                    "func": "=SOMME(T33:T36)",
                    "result": 301
                },
                {
                    "func": "=MIN(O34:S34)",
                    "result": 75
                },
                {
                    "func": "=MOYENNE(P34:Q35)",
                    "result": 64.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "هاملت (شكسبير)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 91
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 113
                },
                {
                    "label": "عدد الكلمات",
                    "value": 63506
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 379,
                    "w": 39,
                    "def": "إضافة مسافة على اليمين أو اليسار"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "N",
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U"
                ],
                "numLines": [
                    33,
                    34,
                    35,
                    36,
                    37
                ],
                "excelTable": [
                    [
                        34,
                        114,
                        62,
                        83,
                        106,
                        83,
                        19
                    ],
                    [
                        16,
                        147,
                        102,
                        89,
                        64,
                        120,
                        61
                    ],
                    [
                        29,
                        146,
                        130,
                        95,
                        78,
                        124,
                        43
                    ],
                    [
                        141,
                        148,
                        46,
                        121,
                        18,
                        93,
                        108
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(O34:U34)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(O36:U36)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(O35:U35)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(O34:U37)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(P37:T37)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(R34:R37)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(O34:O37)",
                    "result": 220
                },
                {
                    "func": "=Si(U37 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(O34:O37)",
                    "result": 141
                },
                {
                    "func": "=SOMME(U34:U37)",
                    "result": 231
                },
                {
                    "func": "=MIN(P35:T35)",
                    "result": 64
                },
                {
                    "func": "=MOYENNE(Q35:R36)",
                    "result": 104
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "الإمبراطورية (هوبز)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 34
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 70
                },
                {
                    "label": "عدد الكلمات",
                    "value": 51030
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "O",
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V"
                ],
                "numLines": [
                    34,
                    35,
                    36,
                    37,
                    38
                ],
                "excelTable": [
                    [
                        139,
                        19,
                        52,
                        140,
                        74,
                        111,
                        149
                    ],
                    [
                        132,
                        47,
                        12,
                        75,
                        112,
                        20,
                        150
                    ],
                    [
                        24,
                        46,
                        135,
                        40,
                        65,
                        40,
                        110
                    ],
                    [
                        12,
                        95,
                        86,
                        135,
                        115,
                        36,
                        11
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(P35:V35)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(P37:V37)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(P36:V36)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(P35:V38)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(Q38:U38)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(S35:S38)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(P35:P38)",
                    "result": 307
                },
                {
                    "func": "=Si(R35 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(P35:P38)",
                    "result": 139
                },
                {
                    "func": "=SOMME(V35:V38)",
                    "result": 420
                },
                {
                    "func": "=MIN(Q36:U36)",
                    "result": 12
                },
                {
                    "func": "=MOYENNE(R36:S37)",
                    "result": 65.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "تاريخ الحيوان (أرسطو)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 53
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 68
                },
                {
                    "label": "عدد الكلمات",
                    "value": 52088
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 186,
                    "w": 34,
                    "o": true,
                    "def": "كتابة الأُسّْ أو المُؤَشِّرْ"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "P",
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W"
                ],
                "numLines": [
                    35,
                    36,
                    37,
                    38,
                    39
                ],
                "excelTable": [
                    [
                        37,
                        21,
                        14,
                        47,
                        65,
                        19,
                        63
                    ],
                    [
                        13,
                        46,
                        100,
                        77,
                        106,
                        91,
                        132
                    ],
                    [
                        119,
                        57,
                        135,
                        103,
                        60,
                        106,
                        147
                    ],
                    [
                        10,
                        118,
                        112,
                        19,
                        138,
                        92,
                        58
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(Q36:W36)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(Q38:W38)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(Q37:W37)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(Q36:W39)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(R39:V39)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(T36:T39)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(Q36:Q39)",
                    "result": 179
                },
                {
                    "func": "=Si(Q37 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "خسارة"
                },
                {
                    "func": "=MAX(Q36:Q39)",
                    "result": 119
                },
                {
                    "func": "=SOMME(W36:W39)",
                    "result": 400
                },
                {
                    "func": "=MIN(R37:V37)",
                    "result": 46
                },
                {
                    "func": "=MOYENNE(S37:T38)",
                    "result": 103.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مشكلة أرسطو"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 63
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 99
                },
                {
                    "label": "عدد الكلمات",
                    "value": 54153
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 79,
                    "w": 14,
                    "o": true,
                    "def": "خط عريض (Gras)"
                },
                {
                    "top": 88,
                    "left": 103,
                    "w": 13,
                    "o": true,
                    "def": "خط مائل (Italique)"
                },
                {
                    "top": 88,
                    "left": 293,
                    "w": 54,
                    "o": true,
                    "def": "محاذاة الخط (يمين، وسط، يسار)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "Q",
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X"
                ],
                "numLines": [
                    36,
                    37,
                    38,
                    39,
                    40
                ],
                "excelTable": [
                    [
                        39,
                        81,
                        99,
                        136,
                        40,
                        31,
                        67
                    ],
                    [
                        117,
                        100,
                        50,
                        68,
                        123,
                        73,
                        51
                    ],
                    [
                        48,
                        41,
                        148,
                        111,
                        132,
                        143,
                        51
                    ],
                    [
                        77,
                        84,
                        101,
                        140,
                        58,
                        51,
                        108
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(R37:X37)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(R39:X39)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(R38:X38)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(R37:X40)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(S40:W40)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(U37:U40)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(R37:R40)",
                    "result": 281
                },
                {
                    "func": "=Si(T40 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(R37:R40)",
                    "result": 117
                },
                {
                    "func": "=SOMME(X37:X40)",
                    "result": 277
                },
                {
                    "func": "=MIN(S38:W38)",
                    "result": 50
                },
                {
                    "func": "=MOYENNE(T38:U39)",
                    "result": 94.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "مقدمة (ابن خلدون)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 105
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 141
                },
                {
                    "label": "عدد الكلمات",
                    "value": 91650
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "R",
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X",
                    "Y"
                ],
                "numLines": [
                    37,
                    38,
                    39,
                    40,
                    41
                ],
                "excelTable": [
                    [
                        42,
                        78,
                        22,
                        114,
                        11,
                        117,
                        67
                    ],
                    [
                        54,
                        93,
                        109,
                        68,
                        93,
                        78,
                        15
                    ],
                    [
                        69,
                        62,
                        98,
                        107,
                        118,
                        71,
                        143
                    ],
                    [
                        91,
                        53,
                        75,
                        114,
                        84,
                        25,
                        113
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(S38:Y38)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(S40:Y40)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(S39:Y39)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(S38:Y41)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(T41:X41)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(V38:V41)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(S38:S41)",
                    "result": 256
                },
                {
                    "func": "=Si(X40 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(S38:S41)",
                    "result": 91
                },
                {
                    "func": "=SOMME(Y38:Y41)",
                    "result": 338
                },
                {
                    "func": "=MIN(T39:X39)",
                    "result": 68
                },
                {
                    "func": "=MOYENNE(U39:V40)",
                    "result": 95.5
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "فيدون (أفلاطون)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 78
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 88
                },
                {
                    "label": "عدد الكلمات",
                    "value": 62656
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 80,
                    "w": 67,
                    "def": "نوع الخط"
                },
                {
                    "top": 18,
                    "left": 489,
                    "w": 16,
                    "def": "علامة الفقرة"
                },
                {
                    "top": 88,
                    "left": 127,
                    "w": 25,
                    "o": true,
                    "def": "خط مُسَّطَرْ (Souligné)"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                },
                {
                    "top": 88,
                    "left": 481,
                    "w": 29,
                    "o": true,
                    "def": "تلوين خلايا الجدول"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "S",
                    "T",
                    "U",
                    "V",
                    "W",
                    "X",
                    "Y",
                    "Z"
                ],
                "numLines": [
                    38,
                    39,
                    40,
                    41,
                    42
                ],
                "excelTable": [
                    [
                        82,
                        18,
                        66,
                        61,
                        40,
                        90,
                        102
                    ],
                    [
                        43,
                        72,
                        83,
                        77,
                        92,
                        47,
                        24
                    ],
                    [
                        40,
                        31,
                        145,
                        56,
                        117,
                        72,
                        58
                    ],
                    [
                        129,
                        139,
                        15,
                        40,
                        116,
                        150,
                        96
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(T39:Z39)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(T41:Z41)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(T40:Z40)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(T39:Z42)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(U42:Y42)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(W39:W42)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(T39:T42)",
                    "result": 294
                },
                {
                    "func": "=Si(X42 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(T39:T42)",
                    "result": 129
                },
                {
                    "func": "=SOMME(Z39:Z42)",
                    "result": 280
                },
                {
                    "func": "=MIN(U40:Y40)",
                    "result": 47
                },
                {
                    "func": "=MOYENNE(V40:W41)",
                    "result": 90.25
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "نسبية (أينشتاين)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 37
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 117
                },
                {
                    "label": "عدد الكلمات",
                    "value": 88803
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 293,
                    "w": 81,
                    "def": "قائمة (رقمية أو نقطية)"
                },
                {
                    "top": 18,
                    "left": 421,
                    "w": 37,
                    "def": "اتجاه الكتابة"
                },
                {
                    "top": 88,
                    "left": 159,
                    "w": 20,
                    "o": true,
                    "def": "خط مشطوب (Barré)"
                },
                {
                    "top": 88,
                    "left": 259,
                    "w": 28,
                    "o": true,
                    "def": "تلوين الخط"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "A",
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H"
                ],
                "numLines": [
                    39,
                    40,
                    41,
                    42,
                    43
                ],
                "excelTable": [
                    [
                        35,
                        93,
                        49,
                        103,
                        108,
                        145,
                        77
                    ],
                    [
                        71,
                        15,
                        121,
                        100,
                        137,
                        81,
                        136
                    ],
                    [
                        92,
                        13,
                        86,
                        84,
                        66,
                        129,
                        83
                    ],
                    [
                        137,
                        140,
                        99,
                        124,
                        64,
                        40,
                        117
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(B40:H40)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(B42:H42)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(B41:H41)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(B40:H43)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(C43:G43)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(E40:E43)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(B40:B43)",
                    "result": 335
                },
                {
                    "func": "=Si(E42 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(B40:B43)",
                    "result": 137
                },
                {
                    "func": "=SOMME(H40:H43)",
                    "result": 413
                },
                {
                    "func": "=MIN(C41:G41)",
                    "result": 15
                },
                {
                    "func": "=MOYENNE(D41:E42)",
                    "result": 97.75
                }
            ]
        }
    },
    {
        "exo1": {
            "part1": [
                {
                    "label": "اسم البرنامج",
                    "value": "Word"
                },
                {
                    "label": "اسم المِلَفْ",
                    "value": "جين أناني (دوكنز)"
                },
                {
                    "label": "رقم الصفحة الحالية",
                    "value": 16
                },
                {
                    "label": "عدد الصفحات الكُلِّي",
                    "value": 58
                },
                {
                    "label": "عدد الكلمات",
                    "value": 43036
                }
            ],
            "part2": [
                {
                    "top": 18,
                    "left": 146,
                    "w": 49,
                    "def": "حجم الخط"
                },
                {
                    "top": 18,
                    "left": 194,
                    "w": 39,
                    "def": "تكبير أو تصغير الخط"
                },
                {
                    "top": 18,
                    "left": 457,
                    "w": 31,
                    "def": "تعديل حدود الجدول"
                },
                {
                    "top": 88,
                    "left": 224,
                    "w": 30,
                    "o": true,
                    "def": "تلوين خلفية الخط"
                },
                {
                    "top": 88,
                    "left": 449,
                    "w": 27,
                    "o": true,
                    "def": "التباعد بين الأسطر"
                }
            ]
        },
        "exo2": {
            "exo2Infos": {
                "getLettersInterval": [
                    "B",
                    "C",
                    "D",
                    "E",
                    "F",
                    "G",
                    "H",
                    "I"
                ],
                "numLines": [
                    40,
                    41,
                    42,
                    43,
                    44
                ],
                "excelTable": [
                    [
                        52,
                        51,
                        135,
                        26,
                        11,
                        39,
                        36
                    ],
                    [
                        66,
                        91,
                        74,
                        33,
                        11,
                        58,
                        59
                    ],
                    [
                        30,
                        84,
                        87,
                        110,
                        37,
                        148,
                        41
                    ],
                    [
                        130,
                        93,
                        125,
                        80,
                        54,
                        69,
                        15
                    ]
                ]
            },
            "part1": [
                {
                    "title": "الدالة التي تحسب مجموع مداخيل شركة فيسبوك",
                    "func": "=SOMME(C41:I41)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أعلى مدخول لنيتفليكس",
                    "func": "=MAX(C43:I43)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل شركة أمازون",
                    "func": "=MOYENNE(C42:I42)"
                },
                {
                    "title": "الدالة التي تحسب معدل مداخيل كل الشركات لكل السنوات",
                    "func": "=MOYENNE(C41:I44)"
                },
                {
                    "title": "الدالة التي ُتْظٍهْر أدنى مدخول لغوغل مابين 2018 و 2022",
                    "func": "=MIN(D44:H44)"
                },
                {
                    "title": "الدالة التي تحسب مجموع مداخيل كل الشركات لسنة 2020",
                    "func": "=SOMME(F41:F44)"
                }
            ],
            "part2": [
                {
                    "func": "=SOMME(C41:C44)",
                    "result": 278
                },
                {
                    "func": "=Si(E42 >= 70 ; <span class=\"font-[tajawal] font-bold\">\"خسارة\"</span> ; <span class=\"font-[tajawal] font-bold\">\"ربح\"</span>)",
                    "result": "ربح"
                },
                {
                    "func": "=MAX(C41:C44)",
                    "result": 130
                },
                {
                    "func": "=SOMME(I41:I44)",
                    "result": 151
                },
                {
                    "func": "=MIN(D42:H42)",
                    "result": 11
                },
                {
                    "func": "=MOYENNE(E42:F43)",
                    "result": 76
                }
            ]
        }
    }
]
export default data